README: Add comparison with libvfio-user and switch to Mermaid for architectural diagram
Signed-off-by: cakehonolulu <30508313+cakehonolulu@users.noreply.github.com>
